Revit 2027 API
BuiltInFailures.ElectricalFailures.ReplaceSpareSpaceOnPanelBoard Property
 Need to replace spare or space on panelboard.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ReplaceSpareSpaceOnPanelBoard { get; }
Public Shared ReadOnly Property ReplaceSpareSpaceOnPanelBoard As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ReplaceSpareSpaceOnPanelBoard {
	FailureDefinitionId^ get ();
}
static member ReplaceSpareSpaceOnPanelBoard : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace